; domain
(define (domain mobileworld_generic)
  ;; Generic MobileWorld domain (task-agnostic), improved:
  ;; 1) status complete must be the LAST action (finalization lock).
  ;; 2) input_text requires the text to be READY (supports causal chains from MCP outputs).
  ;; 3) typing allowed only when the focused field is visible on the current screen.
  ;; 4) focus is cleared on any screen transition; focus actions enforce single-focus.

  (:requirements
    :strips
    :typing
    :negative-preconditions
    :action-costs
    :equality
    :existential-preconditions
    :universal-preconditions
    :conditional-effects
  )

  (:types
    screen target field direction
    text
    goal_status
    tool param deliverable
  )

  (:constants
    home - screen
  )

  (:predicates
    ;; -----------------------
    ;; GUI / navigation state
    ;; -----------------------
    (at-screen ?s - screen)
    (focused ?f - field)

    (target-visible ?t - target ?s - screen)
    (field-visible  ?f - field  ?s - screen)

    (back-link ?from ?to - screen)

    ;; -----------------------
    ;; UI semantics hooks
    ;; -----------------------
    (click-transition ?t - target ?from ?to - screen)
    (doubletap-transition ?t - target ?from ?to - screen)
    (longpress-transition ?t - target ?from ?to - screen)

    (click-focus ?t - target ?s - screen ?f - field)
    (doubletap-focus ?t - target ?s - screen ?f - field)
    (longpress-focus ?t - target ?s - screen ?f - field)

    (drag-transition ?t1 ?t2 - target ?from ?to - screen)
    (scroll-transition ?d - direction ?from ?to - screen)
    (enter-transition ?from ?to - screen)

    ;; -----------------------
    ;; Text & task-control bookkeeping
    ;; -----------------------
    (text-entered ?txt - text)
    (field-has-text ?f - field ?txt - text)

    (answered ?txt - text)
    (asked-user ?txt - text)
    (status-set ?gs - goal_status)

    ;; NEW: text readiness gate (task-agnostic)
    (text-ready ?txt - text)

    ;; NEW: finalization lock (task-agnostic)
    (finalized)

    ;; -----------------------
    ;; MCP tool call modeling
    ;; -----------------------
    (tool-available ?tool - tool)
    (param-for-tool ?par - param ?tool - tool)
    (called ?par - param)

    (mcp-produces ?par - param ?d - deliverable)
    (have ?d - deliverable)
  )

  (:functions
    (total-cost) - number
  )

  ;; ============================================================
  ;; Helper effects used inline
  ;; ============================================================

  ;; ============================================================
  ;; GUI operations
  ;; ============================================================

  (:action click_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (click-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      ;; clear focus when switching screens
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action click_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (click-focus ?t ?s ?f)
    )
    :effect (and
      ;; enforce single-focus
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action double_tap_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (doubletap-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action double_tap_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (doubletap-focus ?t ?s ?f)
    )
    :effect (and
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action long_press_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (longpress-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action long_press_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (longpress-focus ?t ?s ?f)
    )
    :effect (and
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action drag_navigate
    :parameters (?t1 ?t2 - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t1 ?from)
      (target-visible ?t2 ?from)
      (drag-transition ?t1 ?t2 ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  ;; IMPORTANT:
  ;; - must be focused
  ;; - must be on a screen where the field is visible
  ;; - text must be READY
  (:action input_text
    :parameters (?f - field ?txt - text)
    :precondition (and
      (not (finalized))
      (focused ?f)
      (text-ready ?txt)
      (exists (?s - screen)
        (and (at-screen ?s) (field-visible ?f ?s))
      )
    )
    :effect (and
      (text-entered ?txt)
      (field-has-text ?f ?txt)
      (increase (total-cost) 1)
    )
  )

  (:action scroll
    :parameters (?d - direction ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (scroll-transition ?d ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; Navigation
  ;; ============================================================

  (:action navigate_home
    :parameters (?from - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (not (= ?from home))
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen home)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action navigate_back
    :parameters (?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (back-link ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action keyboard_enter
    :parameters (?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (enter-transition ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action wait
    :parameters ()
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; Task control
  ;; ============================================================

  (:action answer
    :parameters (?txt - text)
    :precondition (and
      (not (finalized))
      (text-ready ?txt)   ;; optional but consistent: only answer ready text
    )
    :effect (and
      (answered ?txt)
      (increase (total-cost) 1)
    )
  )

  (:action ask_user
    :parameters (?txt - text)
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (asked-user ?txt)
      (increase (total-cost) 1)
    )
  )

  ;; status is the TERMINAL action: once executed, the task is finalized.
  (:action status
    :parameters (?gs - goal_status)
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (status-set ?gs)
      (finalized)
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; MCP call
  ;; ============================================================

  (:action mcp_call
    :parameters (?tool - tool ?par - param ?d - deliverable)
    :precondition (and
      (not (finalized))
      (tool-available ?tool)
      (param-for-tool ?par ?tool)
      (mcp-produces ?par ?d)
      (not (called ?par))
    )
    :effect (and
      (called ?par)
      (have ?d)
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; NEW: generic "materialize text from deliverable"
  ;; This is intentionally task-agnostic: any deliverable can be turned into any ready text.
  ;; The problem (or executor) decides what the deliverable contains and how the text is formed.
  ;; ============================================================
  (:action make_text_ready_from_deliverable
    :parameters (?d - deliverable ?txt - text)
    :precondition (and
      (not (finalized))
      (have ?d)
    )
    :effect (and
      (text-ready ?txt)
      (increase (total-cost) 1)
    )
  )
)

; problem
(define (problem contacts_message_long_v1)
  (:domain mobileworld_generic)

  (:objects
    ;; -------- screens --------
    s_contacts
    s_contacts_list
    s_contact_alice
    s_message_editor
    s_sent
    - screen

    ;; -------- targets --------
    t_contacts_icon
    t_scroll_anchor
    t_alice_entry
    t_message_button
    t_body_field
    t_send_button
    - target

    ;; -------- fields --------
    f_body - field

    ;; -------- directions --------
    down - direction

    ;; -------- texts --------
    txt_auto_reply - text

    ;; -------- goal status --------
    complete infeasible - goal_status

    ;; -------- tools / params / deliverables --------
    tool_llm - tool
    par_generate_reply - param
    d_reply_text - deliverable
  )

  (:init
    ;; ===== initial screen =====
    (at-screen home)

    ;; ===== tool availability =====
    (tool-available tool_llm)
    (param-for-tool par_generate_reply tool_llm)
    (mcp-produces par_generate_reply d_reply_text)

    ;; ===== visibility =====
    (target-visible t_contacts_icon home)

    (scroll-transition down s_contacts s_contacts_list)

    (target-visible t_scroll_anchor s_contacts)

    (target-visible t_alice_entry s_contacts_list)

    (target-visible t_message_button s_contact_alice)

    (target-visible t_body_field s_message_editor)
    (target-visible t_send_button s_message_editor)
    (field-visible  f_body s_message_editor)

    ;; ===== transitions =====
    (click-transition t_contacts_icon home s_contacts)

    (click-transition t_alice_entry s_contacts_list s_contact_alice)

    (click-transition t_message_button s_contact_alice s_message_editor)

    (click-transition t_send_button s_message_editor s_sent)

    ;; focus mapping
    (click-focus t_body_field s_message_editor f_body)

    ;; back links
    (back-link s_sent s_message_editor)
    (back-link s_message_editor s_contact_alice)
    (back-link s_contact_alice s_contacts_list)
    (back-link s_contacts_list s_contacts)
    (back-link s_contacts home)

    ;; ===== cost =====
    (= (total-cost) 0)
  )

  (:goal (and
    ;; must have message text in body
    (field-has-text f_body txt_auto_reply)

    ;; must return home
    (at-screen home)

    ;; must finalize
    (status-set complete)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (click_navigate t_contacts_icon home s_contacts)
   deleted: (at-screen home)
   added: (at-screen s_contacts)
   goals met: 0 of 3
2. (scroll down s_contacts s_contacts_list)
   deleted: (at-screen s_contacts)
   added: (at-screen s_contacts_list)
   goals met: 0 of 3
3. (click_navigate t_alice_entry s_contacts_list s_contact_alice)
   deleted: (at-screen s_contacts_list)
   added: (at-screen s_contact_alice)
   goals met: 0 of 3
4. (click_navigate t_message_button s_contact_alice s_message_editor)
   deleted: (at-screen s_contact_alice)
   added: (at-screen s_message_editor)
   goals met: 0 of 3
5. (mcp_call tool_llm par_generate_reply d_reply_text)
   added: (called par_generate_reply) (have d_reply_text)
   goals met: 0 of 3
6. (make_text_ready_from_deliverable d_reply_text txt_auto_reply)
   added: (text-ready txt_auto_reply)
   goals met: 0 of 3
7. (click_focus_field t_body_field s_message_editor f_body)
   added: (focused f_body)
   goals met: 0 of 3
8. (input_text f_body txt_auto_reply)
   added: (text-entered txt_auto_reply) (field-has-text f_body txt_auto_reply)
   goals met: 1 of 3
9. (click_navigate t_send_button s_message_editor s_sent)
   deleted: (at-screen s_message_editor) (focused f_body)
   added: (at-screen s_sent)
   goals met: 1 of 3
10. (navigate_back s_sent s_message_editor)
   deleted: (at-screen s_sent)
   added: (at-screen s_message_editor)
   goals met: 1 of 3
11. (navigate_back s_message_editor s_contact_alice)
   deleted: (at-screen s_message_editor)
   added: (at-screen s_contact_alice)
   goals met: 1 of 3
12. (navigate_back s_contact_alice s_contacts_list)
   deleted: (at-screen s_contact_alice)
   added: (at-screen s_contacts_list)
   goals met: 1 of 3
13. (navigate_back s_contacts_list s_contacts)
   deleted: (at-screen s_contacts_list)
   added: (at-screen s_contacts)
   goals met: 1 of 3
14. (navigate_back s_contacts home)
   deleted: (at-screen s_contacts)
   added: (at-screen home)
   goals met: 2 of 3
15. (status complete)
   added: (status-set complete) (finalized)
   goals met: 3 of 3
